final Map<int, Map<String, dynamic>> footerList = {
  1: {
    "surahs": ["الفاتحة 1/1"],
    "nextSurah": "البقرة",
  },
  2: {
    "surahs": ["البقرة 1/48"],
    "nextSurah": "آل عمران",
  },
  3: {
    "surahs": ["البقرة 2/48"],
    "nextSurah": "آل عمران",
  },
  4: {
    "surahs": ["البقرة 3/48"],
    "nextSurah": "آل عمران",
  },
  5: {
    "surahs": ["البقرة 4/48"],
    "nextSurah": "آل عمران",
  },
  6: {
    "surahs": ["البقرة 5/48"],
    "nextSurah": "آل عمران",
  },
  7: {
    "surahs": ["البقرة 6/48"],
    "nextSurah": "آل عمران",
  },
  8: {
    "surahs": ["البقرة 7/48"],
    "nextSurah": "آل عمران",
  },
  9: {
    "surahs": ["البقرة 8/48"],
    "nextSurah": "آل عمران",
  },
  10: {
    "surahs": ["البقرة 9/48"],
    "nextSurah": "آل عمران",
  },
  11: {
    "surahs": ["البقرة 10/48"],
    "nextSurah": "آل عمران",
  },
  12: {
    "surahs": ["البقرة 11/48"],
    "nextSurah": "آل عمران",
  },
  13: {
    "surahs": ["البقرة 12/48"],
    "nextSurah": "آل عمران",
  },
  14: {
    "surahs": ["البقرة 13/48"],
    "nextSurah": "آل عمران",
  },
  15: {
    "surahs": ["البقرة 14/48"],
    "nextSurah": "آل عمران",
  },
  16: {
    "surahs": ["البقرة 15/48"],
    "nextSurah": "آل عمران",
  },
  17: {
    "surahs": ["البقرة 16/48"],
    "nextSurah": "آل عمران",
  },
  18: {
    "surahs": ["البقرة 17/48"],
    "nextSurah": "آل عمران",
  },
  19: {
    "surahs": ["البقرة 18/48"],
    "nextSurah": "آل عمران",
  },
  20: {
    "surahs": ["البقرة 19/48"],
    "nextSurah": "آل عمران",
  },
  21: {
    "surahs": ["البقرة 20/48"],
    "nextSurah": "آل عمران",
  },
  22: {
    "surahs": ["البقرة 21/48"],
    "nextSurah": "آل عمران",
  },
  23: {
    "surahs": ["البقرة 22/48"],
    "nextSurah": "آل عمران",
  },
  24: {
    "surahs": ["البقرة 23/48"],
    "nextSurah": "آل عمران",
  },
  25: {
    "surahs": ["البقرة 24/48"],
    "nextSurah": "آل عمران",
  },
  26: {
    "surahs": ["البقرة 25/48"],
    "nextSurah": "آل عمران",
  },
  27: {
    "surahs": ["البقرة 26/48"],
    "nextSurah": "آل عمران",
  },
  28: {
    "surahs": ["البقرة 27/48"],
    "nextSurah": "آل عمران",
  },
  29: {
    "surahs": ["البقرة 28/48"],
    "nextSurah": "آل عمران",
  },
  30: {
    "surahs": ["البقرة 29/48"],
    "nextSurah": "آل عمران",
  },
  31: {
    "surahs": ["البقرة 30/48"],
    "nextSurah": "آل عمران",
  },
  32: {
    "surahs": ["البقرة 31/48"],
    "nextSurah": "آل عمران",
  },
  33: {
    "surahs": ["البقرة 32/48"],
    "nextSurah": "آل عمران",
  },
  34: {
    "surahs": ["البقرة 33/48"],
    "nextSurah": "آل عمران",
  },
  35: {
    "surahs": ["البقرة 34/48"],
    "nextSurah": "آل عمران",
  },
  36: {
    "surahs": ["البقرة 35/48"],
    "nextSurah": "آل عمران",
  },
  37: {
    "surahs": ["البقرة 36/48"],
    "nextSurah": "آل عمران",
  },
  38: {
    "surahs": ["البقرة 37/48"],
    "nextSurah": "آل عمران",
  },
  39: {
    "surahs": ["البقرة 38/48"],
    "nextSurah": "آل عمران",
  },
  40: {
    "surahs": ["البقرة 39/48"],
    "nextSurah": "آل عمران",
  },
  41: {
    "surahs": ["البقرة 40/48"],
    "nextSurah": "آل عمران",
  },
  42: {
    "surahs": ["البقرة 41/48"],
    "nextSurah": "آل عمران",
  },
  43: {
    "surahs": ["البقرة 42/48"],
    "nextSurah": "آل عمران",
  },
  44: {
    "surahs": ["البقرة 43/48"],
    "nextSurah": "آل عمران",
  },
  45: {
    "surahs": ["البقرة 44/48"],
    "nextSurah": "آل عمران",
  },
  46: {
    "surahs": ["البقرة 45/48"],
    "nextSurah": "آل عمران",
  },
  47: {
    "surahs": ["البقرة 46/48"],
    "nextSurah": "آل عمران",
  },
  48: {
    "surahs": ["البقرة 47/48"],
    "nextSurah": "آل عمران",
  },
  49: {
    "surahs": ["البقرة 48/48"],
    "nextSurah": "آل عمران",
  },
  50: {
    "surahs": ["آل عمران 1/27"],
    "nextSurah": "النساء",
  },
  51: {
    "surahs": ["آل عمران 2/27"],
    "nextSurah": "النساء",
  },
  52: {
    "surahs": ["آل عمران 3/27"],
    "nextSurah": "النساء",
  },
  53: {
    "surahs": ["آل عمران 4/27"],
    "nextSurah": "النساء",
  },
  54: {
    "surahs": ["آل عمران 5/27"],
    "nextSurah": "النساء",
  },
  55: {
    "surahs": ["آل عمران 6/27"],
    "nextSurah": "النساء",
  },
  56: {
    "surahs": ["آل عمران 7/27"],
    "nextSurah": "النساء",
  },
  57: {
    "surahs": ["آل عمران 8/27"],
    "nextSurah": "النساء",
  },
  58: {
    "surahs": ["آل عمران 9/27"],
    "nextSurah": "النساء",
  },
  59: {
    "surahs": ["آل عمران 10/27"],
    "nextSurah": "النساء",
  },
  60: {
    "surahs": ["آل عمران 11/27"],
    "nextSurah": "النساء",
  },
  61: {
    "surahs": ["آل عمران 12/27"],
    "nextSurah": "النساء",
  },
  62: {
    "surahs": ["آل عمران 13/27"],
    "nextSurah": "النساء",
  },
  63: {
    "surahs": ["آل عمران 14/27"],
    "nextSurah": "النساء",
  },
  64: {
    "surahs": ["آل عمران 15/27"],
    "nextSurah": "النساء",
  },
  65: {
    "surahs": ["آل عمران 16/27"],
    "nextSurah": "النساء",
  },
  66: {
    "surahs": ["آل عمران 17/27"],
    "nextSurah": "النساء",
  },
  67: {
    "surahs": ["آل عمران 18/27"],
    "nextSurah": "النساء",
  },
  68: {
    "surahs": ["آل عمران 19/27"],
    "nextSurah": "النساء",
  },
  69: {
    "surahs": ["آل عمران 20/27"],
    "nextSurah": "النساء",
  },
  70: {
    "surahs": ["آل عمران 21/27"],
    "nextSurah": "النساء",
  },
  71: {
    "surahs": ["آل عمران 22/27"],
    "nextSurah": "النساء",
  },
  72: {
    "surahs": ["آل عمران 23/27"],
    "nextSurah": "النساء",
  },
  73: {
    "surahs": ["آل عمران 24/27"],
    "nextSurah": "النساء",
  },
  74: {
    "surahs": ["آل عمران 25/27"],
    "nextSurah": "النساء",
  },
  75: {
    "surahs": ["آل عمران 26/27"],
    "nextSurah": "النساء",
  },
  76: {
    "surahs": ["آل عمران 27/27"],
    "nextSurah": "النساء",
  },
  77: {
    "surahs": ["النساء 1/30"],
    "nextSurah": "المائدة",
  },
  78: {
    "surahs": ["النساء 2/30"],
    "nextSurah": "المائدة",
  },
  79: {
    "surahs": ["النساء 3/30"],
    "nextSurah": "المائدة",
  },
  80: {
    "surahs": ["النساء 4/30"],
    "nextSurah": "المائدة",
  },
  81: {
    "surahs": ["النساء 5/30"],
    "nextSurah": "المائدة",
  },
  82: {
    "surahs": ["النساء 6/30"],
    "nextSurah": "المائدة",
  },
  83: {
    "surahs": ["النساء 7/30"],
    "nextSurah": "المائدة",
  },
  84: {
    "surahs": ["النساء 8/30"],
    "nextSurah": "المائدة",
  },
  85: {
    "surahs": ["النساء 9/30"],
    "nextSurah": "المائدة",
  },
  86: {
    "surahs": ["النساء 10/30"],
    "nextSurah": "المائدة",
  },
  87: {
    "surahs": ["النساء 11/30"],
    "nextSurah": "المائدة",
  },
  88: {
    "surahs": ["النساء 12/30"],
    "nextSurah": "المائدة",
  },
  89: {
    "surahs": ["النساء 13/30"],
    "nextSurah": "المائدة",
  },
  90: {
    "surahs": ["النساء 14/30"],
    "nextSurah": "المائدة",
  },
  91: {
    "surahs": ["النساء 15/30"],
    "nextSurah": "المائدة",
  },
  92: {
    "surahs": ["النساء 16/30"],
    "nextSurah": "المائدة",
  },
  93: {
    "surahs": ["النساء 17/30"],
    "nextSurah": "المائدة",
  },
  94: {
    "surahs": ["النساء 18/30"],
    "nextSurah": "المائدة",
  },
  95: {
    "surahs": ["النساء 19/30"],
    "nextSurah": "المائدة",
  },
  96: {
    "surahs": ["النساء 20/30"],
    "nextSurah": "المائدة",
  },
  97: {
    "surahs": ["النساء 21/30"],
    "nextSurah": "المائدة",
  },
  98: {
    "surahs": ["النساء 22/30"],
    "nextSurah": "المائدة",
  },
  99: {
    "surahs": ["النساء 23/30"],
    "nextSurah": "المائدة",
  },
  100: {
    "surahs": ["النساء 24/30"],
    "nextSurah": "المائدة",
  },
  101: {
    "surahs": ["النساء 25/30"],
    "nextSurah": "المائدة",
  },
  102: {
    "surahs": ["النساء 26/30"],
    "nextSurah": "المائدة",
  },
  103: {
    "surahs": ["النساء 27/30"],
    "nextSurah": "المائدة",
  },
  104: {
    "surahs": ["النساء 28/30"],
    "nextSurah": "المائدة",
  },
  105: {
    "surahs": ["النساء 29/30"],
    "nextSurah": "المائدة",
  },
  106: {
    "surahs": ["النساء 30/30", "المائدة 1/22"],
    "nextSurah": "الأنعام",
  },
  107: {
    "surahs": ["المائدة 2/22"],
    "nextSurah": "الأنعام",
  },
  108: {
    "surahs": ["المائدة 3/22"],
    "nextSurah": "الأنعام",
  },
  109: {
    "surahs": ["المائدة 4/22"],
    "nextSurah": "الأنعام",
  },
  110: {
    "surahs": ["المائدة 5/22"],
    "nextSurah": "الأنعام",
  },
  111: {
    "surahs": ["المائدة 6/22"],
    "nextSurah": "الأنعام",
  },
  112: {
    "surahs": ["المائدة 7/22"],
    "nextSurah": "الأنعام",
  },
  113: {
    "surahs": ["المائدة 8/22"],
    "nextSurah": "الأنعام",
  },
  114: {
    "surahs": ["المائدة 9/22"],
    "nextSurah": "الأنعام",
  },
  115: {
    "surahs": ["المائدة 10/22"],
    "nextSurah": "الأنعام",
  },
  116: {
    "surahs": ["المائدة 11/22"],
    "nextSurah": "الأنعام",
  },
  117: {
    "surahs": ["المائدة 12/22"],
    "nextSurah": "الأنعام",
  },
  118: {
    "surahs": ["المائدة 13/22"],
    "nextSurah": "الأنعام",
  },
  119: {
    "surahs": ["المائدة 14/22"],
    "nextSurah": "الأنعام",
  },
  120: {
    "surahs": ["المائدة 15/22"],
    "nextSurah": "الأنعام",
  },
  121: {
    "surahs": ["المائدة 16/22"],
    "nextSurah": "الأنعام",
  },
  122: {
    "surahs": ["المائدة 17/22"],
    "nextSurah": "الأنعام",
  },
  123: {
    "surahs": ["المائدة 18/22"],
    "nextSurah": "الأنعام",
  },
  124: {
    "surahs": ["المائدة 19/22"],
    "nextSurah": "الأنعام",
  },
  125: {
    "surahs": ["المائدة 20/22"],
    "nextSurah": "الأنعام",
  },
  126: {
    "surahs": ["المائدة 21/22"],
    "nextSurah": "الأنعام",
  },
  127: {
    "surahs": ["المائدة 22/22"],
    "nextSurah": "الأنعام",
  },
  128: {
    "surahs": ["الأنعام 1/23"],
    "nextSurah": "الأعراف",
  },
  129: {
    "surahs": ["الأنعام 2/23"],
    "nextSurah": "الأعراف",
  },
  130: {
    "surahs": ["الأنعام 3/23"],
    "nextSurah": "الأعراف",
  },
  131: {
    "surahs": ["الأنعام 4/23"],
    "nextSurah": "الأعراف",
  },
  132: {
    "surahs": ["الأنعام 5/23"],
    "nextSurah": "الأعراف",
  },
  133: {
    "surahs": ["الأنعام 6/23"],
    "nextSurah": "الأعراف",
  },
  134: {
    "surahs": ["الأنعام 7/23"],
    "nextSurah": "الأعراف",
  },
  135: {
    "surahs": ["الأنعام 8/23"],
    "nextSurah": "الأعراف",
  },
  136: {
    "surahs": ["الأنعام 9/23"],
    "nextSurah": "الأعراف",
  },
  137: {
    "surahs": ["الأنعام 10/23"],
    "nextSurah": "الأعراف",
  },
  138: {
    "surahs": ["الأنعام 11/23"],
    "nextSurah": "الأعراف",
  },
  139: {
    "surahs": ["الأنعام 12/23"],
    "nextSurah": "الأعراف",
  },
  140: {
    "surahs": ["الأنعام 13/23"],
    "nextSurah": "الأعراف",
  },
  141: {
    "surahs": ["الأنعام 14/23"],
    "nextSurah": "الأعراف",
  },
  142: {
    "surahs": ["الأنعام 15/23"],
    "nextSurah": "الأعراف",
  },
  143: {
    "surahs": ["الأنعام 16/23"],
    "nextSurah": "الأعراف",
  },
  144: {
    "surahs": ["الأنعام 17/23"],
    "nextSurah": "الأعراف",
  },
  145: {
    "surahs": ["الأنعام 18/23"],
    "nextSurah": "الأعراف",
  },
  146: {
    "surahs": ["الأنعام 19/23"],
    "nextSurah": "الأعراف",
  },
  147: {
    "surahs": ["الأنعام 20/23"],
    "nextSurah": "الأعراف",
  },
  148: {
    "surahs": ["الأنعام 21/23"],
    "nextSurah": "الأعراف",
  },
  149: {
    "surahs": ["الأنعام 22/23"],
    "nextSurah": "الأعراف",
  },
  150: {
    "surahs": ["الأنعام 23/23"],
    "nextSurah": "الأعراف",
  },
  151: {
    "surahs": ["الأعراف 1/26"],
    "nextSurah": "الأنفال",
  },
  152: {
    "surahs": ["الأعراف 2/26"],
    "nextSurah": "الأنفال",
  },
  153: {
    "surahs": ["الأعراف 3/26"],
    "nextSurah": "الأنفال",
  },
  154: {
    "surahs": ["الأعراف 4/26"],
    "nextSurah": "الأنفال",
  },
  155: {
    "surahs": ["الأعراف 5/26"],
    "nextSurah": "الأنفال",
  },
  156: {
    "surahs": ["الأعراف 6/26"],
    "nextSurah": "الأنفال",
  },
  157: {
    "surahs": ["الأعراف 7/26"],
    "nextSurah": "الأنفال",
  },
  158: {
    "surahs": ["الأعراف 8/26"],
    "nextSurah": "الأنفال",
  },
  159: {
    "surahs": ["الأعراف 9/26"],
    "nextSurah": "الأنفال",
  },
  160: {
    "surahs": ["الأعراف 10/26"],
    "nextSurah": "الأنفال",
  },
  161: {
    "surahs": ["الأعراف 11/26"],
    "nextSurah": "الأنفال",
  },
  162: {
    "surahs": ["الأعراف 12/26"],
    "nextSurah": "الأنفال",
  },
  163: {
    "surahs": ["الأعراف 13/26"],
    "nextSurah": "الأنفال",
  },
  164: {
    "surahs": ["الأعراف 14/26"],
    "nextSurah": "الأنفال",
  },
  165: {
    "surahs": ["الأعراف 15/26"],
    "nextSurah": "الأنفال",
  },
  166: {
    "surahs": ["الأعراف 16/26"],
    "nextSurah": "الأنفال",
  },
  167: {
    "surahs": ["الأعراف 17/26"],
    "nextSurah": "الأنفال",
  },
  168: {
    "surahs": ["الأعراف 18/26"],
    "nextSurah": "الأنفال",
  },
  169: {
    "surahs": ["الأعراف 19/26"],
    "nextSurah": "الأنفال",
  },
  170: {
    "surahs": ["الأعراف 20/26"],
    "nextSurah": "الأنفال",
  },
  171: {
    "surahs": ["الأعراف 21/26"],
    "nextSurah": "الأنفال",
  },
  172: {
    "surahs": ["الأعراف 22/26"],
    "nextSurah": "الأنفال",
  },
  173: {
    "surahs": ["الأعراف 23/26"],
    "nextSurah": "الأنفال",
  },
  174: {
    "surahs": ["الأعراف 24/26"],
    "nextSurah": "الأنفال",
  },
  175: {
    "surahs": ["الأعراف 25/26"],
    "nextSurah": "الأنفال",
  },
  176: {
    "surahs": ["الأعراف 26/26"],
    "nextSurah": "الأنفال",
  },
  177: {
    "surahs": ["الأنفال 1/10"],
    "nextSurah": "التوبة",
  },
  178: {
    "surahs": ["الأنفال 2/10"],
    "nextSurah": "التوبة",
  },
  179: {
    "surahs": ["الأنفال 3/10"],
    "nextSurah": "التوبة",
  },
  180: {
    "surahs": ["الأنفال 4/10"],
    "nextSurah": "التوبة",
  },
  181: {
    "surahs": ["الأنفال 5/10"],
    "nextSurah": "التوبة",
  },
  182: {
    "surahs": ["الأنفال 6/10"],
    "nextSurah": "التوبة",
  },
  183: {
    "surahs": ["الأنفال 7/10"],
    "nextSurah": "التوبة",
  },
  184: {
    "surahs": ["الأنفال 8/10"],
    "nextSurah": "التوبة",
  },
  185: {
    "surahs": ["الأنفال 9/10"],
    "nextSurah": "التوبة",
  },
  186: {
    "surahs": ["الأنفال 10/10"],
    "nextSurah": "التوبة",
  },
  187: {
    "surahs": ["التوبة 1/21"],
    "nextSurah": "يونس",
  },
  188: {
    "surahs": ["التوبة 2/21"],
    "nextSurah": "يونس",
  },
  189: {
    "surahs": ["التوبة 3/21"],
    "nextSurah": "يونس",
  },
  190: {
    "surahs": ["التوبة 4/21"],
    "nextSurah": "يونس",
  },
  191: {
    "surahs": ["التوبة 5/21"],
    "nextSurah": "يونس",
  },
  192: {
    "surahs": ["التوبة 6/21"],
    "nextSurah": "يونس",
  },
  193: {
    "surahs": ["التوبة 7/21"],
    "nextSurah": "يونس",
  },
  194: {
    "surahs": ["التوبة 8/21"],
    "nextSurah": "يونس",
  },
  195: {
    "surahs": ["التوبة 9/21"],
    "nextSurah": "يونس",
  },
  196: {
    "surahs": ["التوبة 10/21"],
    "nextSurah": "يونس",
  },
  197: {
    "surahs": ["التوبة 11/21"],
    "nextSurah": "يونس",
  },
  198: {
    "surahs": ["التوبة 12/21"],
    "nextSurah": "يونس",
  },
  199: {
    "surahs": ["التوبة 13/21"],
    "nextSurah": "يونس",
  },
  200: {
    "surahs": ["التوبة 14/21"],
    "nextSurah": "يونس",
  },
  201: {
    "surahs": ["التوبة 15/21"],
    "nextSurah": "يونس",
  },
  202: {
    "surahs": ["التوبة 16/21"],
    "nextSurah": "يونس",
  },
  203: {
    "surahs": ["التوبة 17/21"],
    "nextSurah": "يونس",
  },
  204: {
    "surahs": ["التوبة 18/21"],
    "nextSurah": "يونس",
  },
  205: {
    "surahs": ["التوبة 19/21"],
    "nextSurah": "يونس",
  },
  206: {
    "surahs": ["التوبة 20/21"],
    "nextSurah": "يونس",
  },
  207: {
    "surahs": ["التوبة 21/21"],
    "nextSurah": "يونس",
  },
  208: {
    "surahs": ["يونس 1/14"],
    "nextSurah": "هود",
  },
  209: {
    "surahs": ["يونس 2/14"],
    "nextSurah": "هود",
  },
  210: {
    "surahs": ["يونس 3/14"],
    "nextSurah": "هود",
  },
  211: {
    "surahs": ["يونس 4/14"],
    "nextSurah": "هود",
  },
  212: {
    "surahs": ["يونس 5/14"],
    "nextSurah": "هود",
  },
  213: {
    "surahs": ["يونس 6/14"],
    "nextSurah": "هود",
  },
  214: {
    "surahs": ["يونس 7/14"],
    "nextSurah": "هود",
  },
  215: {
    "surahs": ["يونس 8/14"],
    "nextSurah": "هود",
  },
  216: {
    "surahs": ["يونس 9/14"],
    "nextSurah": "هود",
  },
  217: {
    "surahs": ["يونس 10/14"],
    "nextSurah": "هود",
  },
  218: {
    "surahs": ["يونس 11/14"],
    "nextSurah": "هود",
  },
  219: {
    "surahs": ["يونس 12/14"],
    "nextSurah": "هود",
  },
  220: {
    "surahs": ["يونس 13/14"],
    "nextSurah": "هود",
  },
  221: {
    "surahs": ["يونس 14/14", "هود 1/15"],
    "nextSurah": "يوسف",
  },
  222: {
    "surahs": ["هود 2/15"],
    "nextSurah": "يوسف",
  },
  223: {
    "surahs": ["هود 3/15"],
    "nextSurah": "يوسف",
  },
  224: {
    "surahs": ["هود 4/15"],
    "nextSurah": "يوسف",
  },
  225: {
    "surahs": ["هود 5/15"],
    "nextSurah": "يوسف",
  },
  226: {
    "surahs": ["هود 6/15"],
    "nextSurah": "يوسف",
  },
  227: {
    "surahs": ["هود 7/15"],
    "nextSurah": "يوسف",
  },
  228: {
    "surahs": ["هود 8/15"],
    "nextSurah": "يوسف",
  },
  229: {
    "surahs": ["هود 9/15"],
    "nextSurah": "يوسف",
  },
  230: {
    "surahs": ["هود 10/15"],
    "nextSurah": "يوسف",
  },
  231: {
    "surahs": ["هود 11/15"],
    "nextSurah": "يوسف",
  },
  232: {
    "surahs": ["هود 12/15"],
    "nextSurah": "يوسف",
  },
  233: {
    "surahs": ["هود 13/15"],
    "nextSurah": "يوسف",
  },
  234: {
    "surahs": ["هود 14/15"],
    "nextSurah": "يوسف",
  },
  235: {
    "surahs": ["هود 15/15", "يوسف 1/14"],
    "nextSurah": "الرعد",
  },
  236: {
    "surahs": ["يوسف 2/14"],
    "nextSurah": "الرعد",
  },
  237: {
    "surahs": ["يوسف 3/14"],
    "nextSurah": "الرعد",
  },
  238: {
    "surahs": ["يوسف 4/14"],
    "nextSurah": "الرعد",
  },
  239: {
    "surahs": ["يوسف 5/14"],
    "nextSurah": "الرعد",
  },
  240: {
    "surahs": ["يوسف 6/14"],
    "nextSurah": "الرعد",
  },
  241: {
    "surahs": ["يوسف 7/14"],
    "nextSurah": "الرعد",
  },
  242: {
    "surahs": ["يوسف 8/14"],
    "nextSurah": "الرعد",
  },
  243: {
    "surahs": ["يوسف 9/14"],
    "nextSurah": "الرعد",
  },
  244: {
    "surahs": ["يوسف 10/14"],
    "nextSurah": "الرعد",
  },
  245: {
    "surahs": ["يوسف 11/14"],
    "nextSurah": "الرعد",
  },
  246: {
    "surahs": ["يوسف 12/14"],
    "nextSurah": "الرعد",
  },
  247: {
    "surahs": ["يوسف 13/14"],
    "nextSurah": "الرعد",
  },
  248: {
    "surahs": ["يوسف 14/14"],
    "nextSurah": "الرعد",
  },
  249: {
    "surahs": ["الرعد 1/7"],
    "nextSurah": "إبراهيم",
  },
  250: {
    "surahs": ["الرعد 2/7"],
    "nextSurah": "إبراهيم",
  },
  251: {
    "surahs": ["الرعد 3/7"],
    "nextSurah": "إبراهيم",
  },
  252: {
    "surahs": ["الرعد 4/7"],
    "nextSurah": "إبراهيم",
  },
  253: {
    "surahs": ["الرعد 5/7"],
    "nextSurah": "إبراهيم",
  },
  254: {
    "surahs": ["الرعد 6/7"],
    "nextSurah": "إبراهيم",
  },
  255: {
    "surahs": ["الرعد 7/7", "إبراهيم 1/7"],
    "nextSurah": "الحجر",
  },
  256: {
    "surahs": ["إبراهيم 2/7"],
    "nextSurah": "الحجر",
  },
  257: {
    "surahs": ["إبراهيم 3/7"],
    "nextSurah": "الحجر",
  },
  258: {
    "surahs": ["إبراهيم 4/7"],
    "nextSurah": "الحجر",
  },
  259: {
    "surahs": ["إبراهيم 5/7"],
    "nextSurah": "الحجر",
  },
  260: {
    "surahs": ["إبراهيم 6/7"],
    "nextSurah": "الحجر",
  },
  261: {
    "surahs": ["إبراهيم 7/7"],
    "nextSurah": "الحجر",
  },
  262: {
    "surahs": ["الحجر 1/6"],
    "nextSurah": "النحل",
  },
  263: {
    "surahs": ["الحجر 2/6"],
    "nextSurah": "النحل",
  },
  264: {
    "surahs": ["الحجر 3/6"],
    "nextSurah": "النحل",
  },
  265: {
    "surahs": ["الحجر 4/6"],
    "nextSurah": "النحل",
  },
  266: {
    "surahs": ["الحجر 5/6"],
    "nextSurah": "النحل",
  },
  267: {
    "surahs": ["الحجر 6/6", "النحل 1/15"],
    "nextSurah": "الإسراء",
  },
  268: {
    "surahs": ["النحل 2/15"],
    "nextSurah": "الإسراء",
  },
  269: {
    "surahs": ["النحل 3/15"],
    "nextSurah": "الإسراء",
  },
  270: {
    "surahs": ["النحل 4/15"],
    "nextSurah": "الإسراء",
  },
  271: {
    "surahs": ["النحل 5/15"],
    "nextSurah": "الإسراء",
  },
  272: {
    "surahs": ["النحل 6/15"],
    "nextSurah": "الإسراء",
  },
  273: {
    "surahs": ["النحل 7/15"],
    "nextSurah": "الإسراء",
  },
  274: {
    "surahs": ["النحل 8/15"],
    "nextSurah": "الإسراء",
  },
  275: {
    "surahs": ["النحل 9/15"],
    "nextSurah": "الإسراء",
  },
  276: {
    "surahs": ["النحل 10/15"],
    "nextSurah": "الإسراء",
  },
  277: {
    "surahs": ["النحل 11/15"],
    "nextSurah": "الإسراء",
  },
  278: {
    "surahs": ["النحل 12/15"],
    "nextSurah": "الإسراء",
  },
  279: {
    "surahs": ["النحل 13/15"],
    "nextSurah": "الإسراء",
  },
  280: {
    "surahs": ["النحل 14/15"],
    "nextSurah": "الإسراء",
  },
  281: {
    "surahs": ["النحل 15/15"],
    "nextSurah": "الإسراء",
  },
  282: {
    "surahs": ["الإسراء 1/12"],
    "nextSurah": "الكهف",
  },
  283: {
    "surahs": ["الإسراء 2/12"],
    "nextSurah": "الكهف",
  },
  284: {
    "surahs": ["الإسراء 3/12"],
    "nextSurah": "الكهف",
  },
  285: {
    "surahs": ["الإسراء 4/12"],
    "nextSurah": "الكهف",
  },
  286: {
    "surahs": ["الإسراء 5/12"],
    "nextSurah": "الكهف",
  },
  287: {
    "surahs": ["الإسراء 6/12"],
    "nextSurah": "الكهف",
  },
  288: {
    "surahs": ["الإسراء 7/12"],
    "nextSurah": "الكهف",
  },
  289: {
    "surahs": ["الإسراء 8/12"],
    "nextSurah": "الكهف",
  },
  290: {
    "surahs": ["الإسراء 9/12"],
    "nextSurah": "الكهف",
  },
  291: {
    "surahs": ["الإسراء 10/12"],
    "nextSurah": "الكهف",
  },
  292: {
    "surahs": ["الإسراء 11/12"],
    "nextSurah": "الكهف",
  },
  293: {
    "surahs": ["الإسراء 12/12", "الكهف 1/12"],
    "nextSurah": "مريم",
  },
  294: {
    "surahs": ["الكهف 2/12"],
    "nextSurah": "مريم",
  },
  295: {
    "surahs": ["الكهف 3/12"],
    "nextSurah": "مريم",
  },
  296: {
    "surahs": ["الكهف 4/12"],
    "nextSurah": "مريم",
  },
  297: {
    "surahs": ["الكهف 5/12"],
    "nextSurah": "مريم",
  },
  298: {
    "surahs": ["الكهف 6/12"],
    "nextSurah": "مريم",
  },
  299: {
    "surahs": ["الكهف 7/12"],
    "nextSurah": "مريم",
  },
  300: {
    "surahs": ["الكهف 8/12"],
    "nextSurah": "مريم",
  },
  301: {
    "surahs": ["الكهف 9/12"],
    "nextSurah": "مريم",
  },
  302: {
    "surahs": ["الكهف 10/12"],
    "nextSurah": "مريم",
  },
  303: {
    "surahs": ["الكهف 11/12"],
    "nextSurah": "مريم",
  },
  304: {
    "surahs": ["الكهف 12/12"],
    "nextSurah": "مريم",
  },
  305: {
    "surahs": ["مريم 1/8"],
    "nextSurah": "طه",
  },
  306: {
    "surahs": ["مريم 2/8"],
    "nextSurah": "طه",
  },
  307: {
    "surahs": ["مريم 3/8"],
    "nextSurah": "طه",
  },
  308: {
    "surahs": ["مريم 4/8"],
    "nextSurah": "طه",
  },
  309: {
    "surahs": ["مريم 5/8"],
    "nextSurah": "طه",
  },
  310: {
    "surahs": ["مريم 6/8"],
    "nextSurah": "طه",
  },
  311: {
    "surahs": ["مريم 7/8"],
    "nextSurah": "طه",
  },
  312: {
    "surahs": ["مريم 8/8", "طه 1/10"],
    "nextSurah": "الأنبياء",
  },
  313: {
    "surahs": ["طه 2/10"],
    "nextSurah": "الأنبياء",
  },
  314: {
    "surahs": ["طه 3/10"],
    "nextSurah": "الأنبياء",
  },
  315: {
    "surahs": ["طه 4/10"],
    "nextSurah": "الأنبياء",
  },
  316: {
    "surahs": ["طه 5/10"],
    "nextSurah": "الأنبياء",
  },
  317: {
    "surahs": ["طه 6/10"],
    "nextSurah": "الأنبياء",
  },
  318: {
    "surahs": ["طه 7/10"],
    "nextSurah": "الأنبياء",
  },
  319: {
    "surahs": ["طه 8/10"],
    "nextSurah": "الأنبياء",
  },
  320: {
    "surahs": ["طه 9/10"],
    "nextSurah": "الأنبياء",
  },
  321: {
    "surahs": ["طه 10/10"],
    "nextSurah": "الأنبياء",
  },
  322: {
    "surahs": ["الأنبياء 1/10"],
    "nextSurah": "الحج",
  },
  323: {
    "surahs": ["الأنبياء 2/10"],
    "nextSurah": "الحج",
  },
  324: {
    "surahs": ["الأنبياء 3/10"],
    "nextSurah": "الحج",
  },
  325: {
    "surahs": ["الأنبياء 4/10"],
    "nextSurah": "الحج",
  },
  326: {
    "surahs": ["الأنبياء 5/10"],
    "nextSurah": "الحج",
  },
  327: {
    "surahs": ["الأنبياء 6/10"],
    "nextSurah": "الحج",
  },
  328: {
    "surahs": ["الأنبياء 7/10"],
    "nextSurah": "الحج",
  },
  329: {
    "surahs": ["الأنبياء 8/10"],
    "nextSurah": "الحج",
  },
  330: {
    "surahs": ["الأنبياء 9/10"],
    "nextSurah": "الحج",
  },
  331: {
    "surahs": ["الأنبياء 10/10"],
    "nextSurah": "الحج",
  },
  332: {
    "surahs": ["الحج 1/10"],
    "nextSurah": "المؤمنون",
  },
  333: {
    "surahs": ["الحج 2/10"],
    "nextSurah": "المؤمنون",
  },
  334: {
    "surahs": ["الحج 3/10"],
    "nextSurah": "المؤمنون",
  },
  335: {
    "surahs": ["الحج 4/10"],
    "nextSurah": "المؤمنون",
  },
  336: {
    "surahs": ["الحج 5/10"],
    "nextSurah": "المؤمنون",
  },
  337: {
    "surahs": ["الحج 6/10"],
    "nextSurah": "المؤمنون",
  },
  338: {
    "surahs": ["الحج 7/10"],
    "nextSurah": "المؤمنون",
  },
  339: {
    "surahs": ["الحج 8/10"],
    "nextSurah": "المؤمنون",
  },
  340: {
    "surahs": ["الحج 9/10"],
    "nextSurah": "المؤمنون",
  },
  341: {
    "surahs": ["الحج 10/10"],
    "nextSurah": "المؤمنون",
  },
  342: {
    "surahs": ["المؤمنون 1/8"],
    "nextSurah": "النور",
  },
  343: {
    "surahs": ["المؤمنون 2/8"],
    "nextSurah": "النور",
  },
  344: {
    "surahs": ["المؤمنون 3/8"],
    "nextSurah": "النور",
  },
  345: {
    "surahs": ["المؤمنون 4/8"],
    "nextSurah": "النور",
  },
  346: {
    "surahs": ["المؤمنون 5/8"],
    "nextSurah": "النور",
  },
  347: {
    "surahs": ["المؤمنون 6/8"],
    "nextSurah": "النور",
  },
  348: {
    "surahs": ["المؤمنون 7/8"],
    "nextSurah": "النور",
  },
  349: {
    "surahs": ["المؤمنون 8/8"],
    "nextSurah": "النور",
  },
  350: {
    "surahs": ["النور 1/10"],
    "nextSurah": "الفرقان",
  },
  351: {
    "surahs": ["النور 2/10"],
    "nextSurah": "الفرقان",
  },
  352: {
    "surahs": ["النور 3/10"],
    "nextSurah": "الفرقان",
  },
  353: {
    "surahs": ["النور 4/10"],
    "nextSurah": "الفرقان",
  },
  354: {
    "surahs": ["النور 5/10"],
    "nextSurah": "الفرقان",
  },
  355: {
    "surahs": ["النور 6/10"],
    "nextSurah": "الفرقان",
  },
  356: {
    "surahs": ["النور 7/10"],
    "nextSurah": "الفرقان",
  },
  357: {
    "surahs": ["النور 8/10"],
    "nextSurah": "الفرقان",
  },
  358: {
    "surahs": ["النور 9/10"],
    "nextSurah": "الفرقان",
  },
  359: {
    "surahs": ["النور 10/10", "الفرقان 1/8"],
    "nextSurah": "الشعراء",
  },
  360: {
    "surahs": ["الفرقان 2/8"],
    "nextSurah": "الشعراء",
  },
  361: {
    "surahs": ["الفرقان 3/8"],
    "nextSurah": "الشعراء",
  },
  362: {
    "surahs": ["الفرقان 4/8"],
    "nextSurah": "الشعراء",
  },
  363: {
    "surahs": ["الفرقان 5/8"],
    "nextSurah": "الشعراء",
  },
  364: {
    "surahs": ["الفرقان 6/8"],
    "nextSurah": "الشعراء",
  },
  365: {
    "surahs": ["الفرقان 7/8"],
    "nextSurah": "الشعراء",
  },
  366: {
    "surahs": ["الفرقان 8/8"],
    "nextSurah": "الشعراء",
  },
  367: {
    "surahs": ["الشعراء 1/10"],
    "nextSurah": "النمل",
  },
  368: {
    "surahs": ["الشعراء 2/10"],
    "nextSurah": "النمل",
  },
  369: {
    "surahs": ["الشعراء 3/10"],
    "nextSurah": "النمل",
  },
  370: {
    "surahs": ["الشعراء 4/10"],
    "nextSurah": "النمل",
  },
  371: {
    "surahs": ["الشعراء 5/10"],
    "nextSurah": "النمل",
  },
  372: {
    "surahs": ["الشعراء 6/10"],
    "nextSurah": "النمل",
  },
  373: {
    "surahs": ["الشعراء 7/10"],
    "nextSurah": "النمل",
  },
  374: {
    "surahs": ["الشعراء 8/10"],
    "nextSurah": "النمل",
  },
  375: {
    "surahs": ["الشعراء 9/10"],
    "nextSurah": "النمل",
  },
  376: {
    "surahs": ["الشعراء 10/10"],
    "nextSurah": "النمل",
  },
  377: {
    "surahs": ["النمل 1/9"],
    "nextSurah": "القصص",
  },
  378: {
    "surahs": ["النمل 2/9"],
    "nextSurah": "القصص",
  },
  379: {
    "surahs": ["النمل 3/9"],
    "nextSurah": "القصص",
  },
  380: {
    "surahs": ["النمل 4/9"],
    "nextSurah": "القصص",
  },
  381: {
    "surahs": ["النمل 5/9"],
    "nextSurah": "القصص",
  },
  382: {
    "surahs": ["النمل 6/9"],
    "nextSurah": "القصص",
  },
  383: {
    "surahs": ["النمل 7/9"],
    "nextSurah": "القصص",
  },
  384: {
    "surahs": ["النمل 8/9"],
    "nextSurah": "القصص",
  },
  385: {
    "surahs": ["النمل 9/9", "القصص 1/12"],
    "nextSurah": "العنكبوت",
  },
  386: {
    "surahs": ["القصص 2/12"],
    "nextSurah": "العنكبوت",
  },
  387: {
    "surahs": ["القصص 3/12"],
    "nextSurah": "العنكبوت",
  },
  388: {
    "surahs": ["القصص 4/12"],
    "nextSurah": "العنكبوت",
  },
  389: {
    "surahs": ["القصص 5/12"],
    "nextSurah": "العنكبوت",
  },
  390: {
    "surahs": ["القصص 6/12"],
    "nextSurah": "العنكبوت",
  },
  391: {
    "surahs": ["القصص 7/12"],
    "nextSurah": "العنكبوت",
  },
  392: {
    "surahs": ["القصص 8/12"],
    "nextSurah": "العنكبوت",
  },
  393: {
    "surahs": ["القصص 9/12"],
    "nextSurah": "العنكبوت",
  },
  394: {
    "surahs": ["القصص 10/12"],
    "nextSurah": "العنكبوت",
  },
  395: {
    "surahs": ["القصص 11/12"],
    "nextSurah": "العنكبوت",
  },
  396: {
    "surahs": ["القصص 12/12", "العنكبوت 1/9"],
    "nextSurah": "الروم",
  },
  397: {
    "surahs": ["العنكبوت 2/9"],
    "nextSurah": "الروم",
  },
  398: {
    "surahs": ["العنكبوت 3/9"],
    "nextSurah": "الروم",
  },
  399: {
    "surahs": ["العنكبوت 4/9"],
    "nextSurah": "الروم",
  },
  400: {
    "surahs": ["العنكبوت 5/9"],
    "nextSurah": "الروم",
  },
  401: {
    "surahs": ["العنكبوت 6/9"],
    "nextSurah": "الروم",
  },
  402: {
    "surahs": ["العنكبوت 7/9"],
    "nextSurah": "الروم",
  },
  403: {
    "surahs": ["العنكبوت 8/9"],
    "nextSurah": "الروم",
  },
  404: {
    "surahs": ["العنكبوت 9/9", "الروم 1/7"],
    "nextSurah": "لقمان",
  },
  405: {
    "surahs": ["الروم 2/7"],
    "nextSurah": "لقمان",
  },
  406: {
    "surahs": ["الروم 3/7"],
    "nextSurah": "لقمان",
  },
  407: {
    "surahs": ["الروم 4/7"],
    "nextSurah": "لقمان",
  },
  408: {
    "surahs": ["الروم 5/7"],
    "nextSurah": "لقمان",
  },
  409: {
    "surahs": ["الروم 6/7"],
    "nextSurah": "لقمان",
  },
  410: {
    "surahs": ["الروم 7/7"],
    "nextSurah": "لقمان",
  },
  411: {
    "surahs": ["لقمان 1/4"],
    "nextSurah": "السجدة",
  },
  412: {
    "surahs": ["لقمان 2/4"],
    "nextSurah": "السجدة",
  },
  413: {
    "surahs": ["لقمان 3/4"],
    "nextSurah": "السجدة",
  },
  414: {
    "surahs": ["لقمان 4/4"],
    "nextSurah": "السجدة",
  },
  415: {
    "surahs": ["السجدة 1/3"],
    "nextSurah": "الأحزاب",
  },
  416: {
    "surahs": ["السجدة 2/3"],
    "nextSurah": "الأحزاب",
  },
  417: {
    "surahs": ["السجدة 3/3"],
    "nextSurah": "الأحزاب",
  },
  418: {
    "surahs": ["الأحزاب 1/10"],
    "nextSurah": "سبأ",
  },
  419: {
    "surahs": ["الأحزاب 2/10"],
    "nextSurah": "سبأ",
  },
  420: {
    "surahs": ["الأحزاب 3/10"],
    "nextSurah": "سبأ",
  },
  421: {
    "surahs": ["الأحزاب 4/10"],
    "nextSurah": "سبأ",
  },
  422: {
    "surahs": ["الأحزاب 5/10"],
    "nextSurah": "سبأ",
  },
  423: {
    "surahs": ["الأحزاب 6/10"],
    "nextSurah": "سبأ",
  },
  424: {
    "surahs": ["الأحزاب 7/10"],
    "nextSurah": "سبأ",
  },
  425: {
    "surahs": ["الأحزاب 8/10"],
    "nextSurah": "سبأ",
  },
  426: {
    "surahs": ["الأحزاب 9/10"],
    "nextSurah": "سبأ",
  },
  427: {
    "surahs": ["الأحزاب 10/10"],
    "nextSurah": "سبأ",
  },
  428: {
    "surahs": ["سبأ 1/7"],
    "nextSurah": "فاطر",
  },
  429: {
    "surahs": ["سبأ 2/7"],
    "nextSurah": "فاطر",
  },
  430: {
    "surahs": ["سبأ 3/7"],
    "nextSurah": "فاطر",
  },
  431: {
    "surahs": ["سبأ 4/7"],
    "nextSurah": "فاطر",
  },
  432: {
    "surahs": ["سبأ 5/7"],
    "nextSurah": "فاطر",
  },
  433: {
    "surahs": ["سبأ 6/7"],
    "nextSurah": "فاطر",
  },
  434: {
    "surahs": ["سبأ 7/7", "فاطر 1/7"],
    "nextSurah": "يس",
  },
  435: {
    "surahs": ["فاطر 2/7"],
    "nextSurah": "يس",
  },
  436: {
    "surahs": ["فاطر 3/7"],
    "nextSurah": "يس",
  },
  437: {
    "surahs": ["فاطر 4/7"],
    "nextSurah": "يس",
  },
  438: {
    "surahs": ["فاطر 5/7"],
    "nextSurah": "يس",
  },
  439: {
    "surahs": ["فاطر 6/7"],
    "nextSurah": "يس",
  },
  440: {
    "surahs": ["فاطر 7/7", "يس 1/6"],
    "nextSurah": "الصافات",
  },
  441: {
    "surahs": ["يس 2/6"],
    "nextSurah": "الصافات",
  },
  442: {
    "surahs": ["يس 3/6"],
    "nextSurah": "الصافات",
  },
  443: {
    "surahs": ["يس 4/6"],
    "nextSurah": "الصافات",
  },
  444: {
    "surahs": ["يس 5/6"],
    "nextSurah": "الصافات",
  },
  445: {
    "surahs": ["يس 6/6"],
    "nextSurah": "الصافات",
  },
  446: {
    "surahs": ["الصافات 1/7"],
    "nextSurah": "ص",
  },
  447: {
    "surahs": ["الصافات 2/7"],
    "nextSurah": "ص",
  },
  448: {
    "surahs": ["الصافات 3/7"],
    "nextSurah": "ص",
  },
  449: {
    "surahs": ["الصافات 4/7"],
    "nextSurah": "ص",
  },
  450: {
    "surahs": ["الصافات 5/7"],
    "nextSurah": "ص",
  },
  451: {
    "surahs": ["الصافات 6/7"],
    "nextSurah": "ص",
  },
  452: {
    "surahs": ["الصافات 7/7"],
    "nextSurah": "ص",
  },
  453: {
    "surahs": ["ص 1/6"],
    "nextSurah": "الزمر",
  },
  454: {
    "surahs": ["ص 2/6"],
    "nextSurah": "الزمر",
  },
  455: {
    "surahs": ["ص 3/6"],
    "nextSurah": "الزمر",
  },
  456: {
    "surahs": ["ص 4/6"],
    "nextSurah": "الزمر",
  },
  457: {
    "surahs": ["ص 5/6"],
    "nextSurah": "الزمر",
  },
  458: {
    "surahs": ["ص 6/6", "الزمر 1/10"],
    "nextSurah": "غافر",
  },
  459: {
    "surahs": ["الزمر 2/10"],
    "nextSurah": "غافر",
  },
  460: {
    "surahs": ["الزمر 3/10"],
    "nextSurah": "غافر",
  },
  461: {
    "surahs": ["الزمر 4/10"],
    "nextSurah": "غافر",
  },
  462: {
    "surahs": ["الزمر 5/10"],
    "nextSurah": "غافر",
  },
  463: {
    "surahs": ["الزمر 6/10"],
    "nextSurah": "غافر",
  },
  464: {
    "surahs": ["الزمر 7/10"],
    "nextSurah": "غافر",
  },
  465: {
    "surahs": ["الزمر 8/10"],
    "nextSurah": "غافر",
  },
  466: {
    "surahs": ["الزمر 9/10"],
    "nextSurah": "غافر",
  },
  467: {
    "surahs": ["الزمر 10/10", "غافر 1/10"],
    "nextSurah": "فصلت",
  },
  468: {
    "surahs": ["غافر 2/10"],
    "nextSurah": "فصلت",
  },
  469: {
    "surahs": ["غافر 3/10"],
    "nextSurah": "فصلت",
  },
  470: {
    "surahs": ["غافر 4/10"],
    "nextSurah": "فصلت",
  },
  471: {
    "surahs": ["غافر 5/10"],
    "nextSurah": "فصلت",
  },
  472: {
    "surahs": ["غافر 6/10"],
    "nextSurah": "فصلت",
  },
  473: {
    "surahs": ["غافر 7/10"],
    "nextSurah": "فصلت",
  },
  474: {
    "surahs": ["غافر 8/10"],
    "nextSurah": "فصلت",
  },
  475: {
    "surahs": ["غافر 9/10"],
    "nextSurah": "فصلت",
  },
  476: {
    "surahs": ["غافر 10/10"],
    "nextSurah": "فصلت",
  },
  477: {
    "surahs": ["فصلت 1/6"],
    "nextSurah": "الشورى",
  },
  478: {
    "surahs": ["فصلت 2/6"],
    "nextSurah": "الشورى",
  },
  479: {
    "surahs": ["فصلت 3/6"],
    "nextSurah": "الشورى",
  },
  480: {
    "surahs": ["فصلت 4/6"],
    "nextSurah": "الشورى",
  },
  481: {
    "surahs": ["فصلت 5/6"],
    "nextSurah": "الشورى",
  },
  482: {
    "surahs": ["فصلت 6/6"],
    "nextSurah": "الشورى",
  },
  483: {
    "surahs": ["الشورى 1/7"],
    "nextSurah": "الزخرف",
  },
  484: {
    "surahs": ["الشورى 2/7"],
    "nextSurah": "الزخرف",
  },
  485: {
    "surahs": ["الشورى 3/7"],
    "nextSurah": "الزخرف",
  },
  486: {
    "surahs": ["الشورى 4/7"],
    "nextSurah": "الزخرف",
  },
  487: {
    "surahs": ["الشورى 5/7"],
    "nextSurah": "الزخرف",
  },
  488: {
    "surahs": ["الشورى 6/7"],
    "nextSurah": "الزخرف",
  },
  489: {
    "surahs": ["الشورى 7/7", "الزخرف 1/7"],
    "nextSurah": "الدخان",
  },
  490: {
    "surahs": ["الزخرف 2/7"],
    "nextSurah": "الدخان",
  },
  491: {
    "surahs": ["الزخرف 3/7"],
    "nextSurah": "الدخان",
  },
  492: {
    "surahs": ["الزخرف 4/7"],
    "nextSurah": "الدخان",
  },
  493: {
    "surahs": ["الزخرف 5/7"],
    "nextSurah": "الدخان",
  },
  494: {
    "surahs": ["الزخرف 6/7"],
    "nextSurah": "الدخان",
  },
  495: {
    "surahs": ["الزخرف 7/7"],
    "nextSurah": "الدخان",
  },
  496: {
    "surahs": ["الدخان 1/3"],
    "nextSurah": "الجاثية",
  },
  497: {
    "surahs": ["الدخان 2/3"],
    "nextSurah": "الجاثية",
  },
  498: {
    "surahs": ["الدخان 3/3"],
    "nextSurah": "الجاثية",
  },
  499: {
    "surahs": ["الجاثية 1/4"],
    "nextSu*rah": "الأحقاف",
  },
  500: {
    "surahs": ["الجاثية 2/4"],
    "nextSurah": "الأحقاف",
  },
  501: {
    "surahs": ["الجاثية 3/4"],
    "nextSurah": "الأحقاف",
  },
  502: {
    "surahs": ["الجاثية 4/4", "الأحقاف 1/5"],
    "nextSurah": "محمد",
  },
  503: {
    "surahs": ["الأحقاف 2/5"],
    "nextSurah": "محمد",
  },
  504: {
    "surahs": ["الأحقاف 3/5"],
    "nextSurah": "محمد",
  },
  505: {
    "surahs": ["الأحقاف 4/5"],
    "nextSurah": "محمد",
  },
  506: {
    "surahs": ["الأحقاف 5/5"],
    "nextSurah": "محمد",
  },
  507: {
    "surahs": ["محمد 1/4"],
    "nextSurah": "الفتح",
  },
  508: {
    "surahs": ["محمد 2/4"],
    "nextSurah": "الفتح",
  },
  509: {
    "surahs": ["محمد 3/4"],
    "nextSurah": "الفتح",
  },
  510: {
    "surahs": ["محمد 4/4"],
    "nextSurah": "الفتح",
  },
  511: {
    "surahs": ["الفتح 1/5"],
    "nextSurah": "الحجرات",
  },
  512: {
    "surahs": ["الفتح 2/5"],
    "nextSurah": "الحجرات",
  },
  513: {
    "surahs": ["الفتح 3/5"],
    "nextSurah": "الحجرات",
  },
  514: {
    "surahs": ["الفتح 4/5"],
    "nextSurah": "الحجرات",
  },
  515: {
    "surahs": ["الفتح 5/5", "الحجرات 1/3"],
    "nextSurah": "ق",
  },
  516: {
    "surahs": ["الحجرات 2/3"],
    "nextSurah": "ق",
  },
  517: {
    "surahs": ["الحجرات 3/3"],
    "nextSurah": "ق",
  },
  518: {
    "surahs": ["ق 1/3"],
    "nextSurah": "الذاريات",
  },
  519: {
    "surahs": ["ق 2/3"],
    "nextSurah": "الذاريات",
  },
  520: {
    "surahs": ["ق 3/3", "الذاريات 1/4"],
    "nextSurah": "الطور",
  },
  521: {
    "surahs": ["الذاريات 2/4"],
    "nextSurah": "الطور",
  },
  522: {
    "surahs": ["الذاريات 3/4"],
    "nextSurah": "الطور",
  },
  523: {
    "surahs": ["الذاريات 4/4", "الطور 1/3"],
    "nextSurah": "النجم",
  },
  524: {
    "surahs": ["الطور 2/3"],
    "nextSurah": "النجم",
  },
  525: {
    "surahs": ["الطور 3/3"],
    "nextSurah": "النجم",
  },
  526: {
    "surahs": ["النجم 1/3"],
    "nextSurah": "القمر",
  },
  527: {
    "surahs": ["النجم 2/3"],
    "nextSurah": "القمر",
  },
  528: {
    "surahs": ["النجم 3/3", "القمر 1/4"],
    "nextSurah": "الرحمن",
  },
  529: {
    "surahs": ["القمر 2/4"],
    "nextSurah": "الرحمن",
  },
  530: {
    "surahs": ["القمر 3/4"],
    "nextSurah": "الرحمن",
  },
  531: {
    "surahs": ["القمر 4/4", "الرحمن 1/4"],
    "nextSurah": "الواقعة",
  },
  532: {
    "surahs": ["الرحمن 2/4"],
    "nextSurah": "الواقعة",
  },
  533: {
    "surahs": ["الرحمن 3/4"],
    "nextSurah": "الواقعة",
  },
  534: {
    "surahs": ["الرحمن 4/4", "الواقعة 1/4"],
    "nextSurah": "الحديد",
  },
  535: {
    "surahs": ["الواقعة 2/4"],
    "nextSurah": "الحديد",
  },
  536: {
    "surahs": ["الواقعة 3/4"],
    "nextSurah": "الحديد",
  },
  537: {
    "surahs": ["الواقعة 4/4", "الحديد 1/5"],
    "nextSurah": "المجادلة",
  },
  538: {
    "surahs": ["الحديد 2/5"],
    "nextSurah": "المجادلة",
  },
  539: {
    "surahs": ["الحديد 3/5"],
    "nextSurah": "المجادلة",
  },
  540: {
    "surahs": ["الحديد 4/5"],
    "nextSurah": "المجادلة",
  },
  541: {
    "surahs": ["الحديد 5/5"],
    "nextSurah": "المجادلة",
  },
  542: {
    "surahs": ["المجادلة 1/4"],
    "nextSurah": "الحشر",
  },
  543: {
    "surahs": ["المجادلة 2/4"],
    "nextSurah": "الحشر",
  },
  544: {
    "surahs": ["المجادلة 3/4"],
    "nextSurah": "الحشر",
  },
  545: {
    "surahs": ["المجادلة 4/4", "الحشر 1/4"],
    "nextSurah": "الممتحنة",
  },
  546: {
    "surahs": ["الحشر 2/4"],
    "nextSurah": "الممتحنة",
  },
  547: {
    "surahs": ["الحشر 3/4"],
    "nextSurah": "الممتحنة",
  },
  548: {
    "surahs": ["الحشر 4/4"],
    "nextSurah": "الممتحنة",
  },
  549: {
    "surahs": ["الممتحنة 1/3"],
    "nextSurah": "الصف",
  },
  550: {
    "surahs": ["الممتحنة 2/3"],
    "nextSurah": "الصف",
  },
  551: {
    "surahs": ["الممتحنة 3/3", "الصف 1/2"],
    "nextSurah": "الجمعة",
  },
  552: {
    "surahs": ["الصف 2/2"],
    "nextSurah": "الجمعة",
  },
  553: {
    "surahs": ["الجمعة 1/2"],
    "nextSurah": "المنافقون",
  },
  554: {
    "surahs": ["الجمعة 2/2", "المنافقون 1/2"],
    "nextSurah": "التغابن",
  },
  555: {
    "surahs": ["المنافقون 2/2"],
    "nextSurah": "التغابن",
  },
  556: {
    "surahs": ["التغابن 1/2"],
    "nextSurah": "الطلاق",
  },
  557: {
    "surahs": ["التغابن 2/2"],
    "nextSurah": "الطلاق",
  },
  558: {
    "surahs": ["الطلاق 1/2"],
    "nextSurah": "التحريم",
  },
  559: {
    "surahs": ["الطلاق 2/2"],
    "nextSurah": "التحريم",
  },
  560: {
    "surahs": ["التحريم 1/2"],
    "nextSurah": "الملك",
  },
  561: {
    "surahs": ["التحريم 2/2"],
    "nextSurah": "الملك",
  },
  562: {
    "surahs": ["الملك 1/3"],
    "nextSurah": "القلم",
  },
  563: {
    "surahs": ["الملك 2/3"],
    "nextSurah": "القلم",
  },
  564: {
    "surahs": ["الملك 3/3", "القلم 1/3"],
    "nextSurah": "الحاقة",
  },
  565: {
    "surahs": ["القلم 2/3"],
    "nextSurah": "الحاقة",
  },
  566: {
    "surahs": ["القلم 3/3", "الحاقة 1/3"],
    "nextSurah": "المعارج",
  },
  567: {
    "surahs": ["الحاقة 2/3"],
    "nextSurah": "المعارج",
  },
  568: {
    "surahs": ["الحاقة 3/3", "المعارج 1/3"],
    "nextSurah": "نوح",
  },
  569: {
    "surahs": ["المعارج 2/3"],
    "nextSurah": "نوح",
  },
  570: {
    "surahs": ["المعارج 3/3", "نوح 1/2"],
    "nextSurah": "جن",
  },
  571: {
    "surahs": ["نوح 2/2"],
    "nextSurah": "جن",
  },
  572: {
    "surahs": ["جن 1/2"],
    "nextSurah": "المزمل",
  },
  573: {
    "surahs": ["جن 2/2"],
    "nextSurah": "المزمل",
  },
  574: {
    "surahs": ["المزمل 1/2"],
    "nextSurah": "المدثر",
  },
  575: {
    "surahs": ["المزمل 2/2", "المدثر 1/3"],
    "nextSurah": "القيامة",
  },
  576: {
    "surahs": ["المدثر 2/3"],
    "nextSurah": "القيامة",
  },
  577: {
    "surahs": ["المدثر 3/3", "القيامة 1/2"],
    "nextSurah": "الإنسان",
  },
  578: {
    "surahs": ["القيامة 2/2", "الإنسان 1/3"],
    "nextSurah": "المرسلات",
  },
  579: {
    "surahs": ["الإنسان 2/3"],
    "nextSurah": "المرسلات",
  },
  580: {
    "surahs": ["الإنسان 3/3", "المرسلات 1/2"],
    "nextSurah": "النبأ",
  },
  581: {
    "surahs": ["المرسلات 2/2"],
    "nextSurah": "النبأ",
  },
  582: {
    "surahs": ["النبأ 1/2"],
    "nextSurah": "النازعات",
  },
  583: {
    "surahs": ["النبأ 2/2", "النازعات 1/2"],
    "nextSurah": "عبس",
  },
  584: {
    "surahs": ["النازعات 2/2"],
    "nextSurah": "عبس",
  },
  585: {
    "surahs": ["عبس 1/2"],
    "nextSurah": "التكوير",
  },
  586: {
    "surahs": ["عبس 2/2", "التكوير 1/1"],
    "nextSurah": "الانفطار",
  },
  587: {
    "surahs": ["الانفطار 1/1", "المطففين 1/3"],
    "nextSurah": "الانشقاق",
  },
  588: {
    "surahs": ["المطففين 2/3"],
    "nextSurah": "الانشقاق",
  },
  589: {
    "surahs": ["المطففين 3/3", "الانشقاق 1/2"],
    "nextSurah": "البروج",
  },
  590: {
    "surahs": ["الانشقاق 2/2", "البروج 1/1"],
    "nextSurah": "الطارق",
  },
  591: {
    "surahs": ["الطارق 1/1", "الأعلى 1/2"],
    "nextSurah": "الغاشية",
  },
  592: {
    "surahs": ["الأعلى 2/2", "الغاشية 1/2"],
    "nextSurah": "الفجر",
  },
  593: {
    "surahs": ["الغاشية 2/2", "الفجر 1/2"],
    "nextSurah": "البلد",
  },
  594: {
    "surahs": ["الفجر 2/2", "البلد 1/2"],
    "nextSurah": "الشمس",
  },
  595: {
    "surahs": ["البلد 2/2", "الشمس 1/1", "الليل 1/2"],
    "nextSurah": "الضحى",
  },
  596: {
    "surahs": ["الليل 2/2", "الضحى 1/1", "الشرح 1/2"],
    "nextSurah": "التين",
  },
  597: {
    "surahs": ["الشرح 2/2", "التين 1/1", "العلق 1/2"],
    "nextSurah": "القدر",
  },
  598: {
    "surahs": ["العلق 2/2", "القدر 1/1", "البينة 1/2"],
    "nextSurah": "الزلزلة",
  },
  599: {
    "surahs": ["البينة 2/2", "الزلزلة 1/1", "العاديات 1/2"],
    "nextSurah": "القارعة",
  },
  600: {
    "surahs": ["العاديات 2/2", "القارعة 1/1", "التكاثر 1/1"],
    "nextSurah": "العصر",
  },
  601: {
    "surahs": ["العصر 1/1", "الهمزة 1/1", "الفيل 1/1"],
    "nextSurah": "قريش",
  },
  602: {
    "surahs": ["قريش 1/1", "الماعون 1/1", "الكوثر 1/1"],
    "nextSurah": "الكافرون",
  },
  603: {
    "surahs": ["الكافرون 1/1", "النصر 1/1", "المسد 1/1"],
    "nextSurah": "الإخلاص",
  },
  604: {
    "surahs": ["الإخلاص 1/1", "الفلق 1/1", "الناس 1/1"],
    "nextSurah": null,
  },
};
